#Область ПрограммныйИнтерфейс

// Цена номенклатуры.
// 
// Параметры:
//  Квартира - СправочникСсылка.Квартиры
//  Период - Дата, Неопределено - Период
// 
// Возвращаемое значение:
//  Число - Цена за день аренды
//
Функция ЦенаНаКвартиру(Квартира, Период = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Квартира", Квартира);
	
	РеквизитыЗаписи = РегистрыСведений.ЦеныНаКвартиры.ПолучитьПоследнее(Период, Отбор);
	
	Возврат РеквизитыЗаписи.ЦенаЗаДень;
	
КонецФункции

#КонецОбласти