#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура ПодсчетСтоимости()
	ДлительностьАренды =(НачалоДня(Объект.ДатаОкончания+86400) - НачалоДня(Объект.ДатаНачала)) / (60 * 60 * 24);
	
	Объект.Стоимость = ДлительностьАренды * Объект.ЦенаЗаДень;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПодсчетСтоимости()
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПодсчетСтоимости()
КонецПроцедуры

&НаКлиенте
Процедура ЦенаЗаДеньПриИзменении(Элемент)
	ПодсчетСтоимости()
КонецПроцедуры
#КонецОбласти