#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ЦеныНаКвартиры
	Движения.ЦеныНаКвартиры.Записывать = Истина;
	Для Каждого ТекСтрокаЦеныНаКвартиры из ЦеныНаКвартиры Цикл
		Движение = Движения.ЦеныНаКвартиры.Добавить();
		Движение.Квартира = ТекСтрокаЦеныНаКвартиры.Квартира;
		Движение.ЦенаЗаДень = ТекСтрокаЦеныНаКвартиры.ЦенаЗаДень;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли